[
	{
		"number": 1,
		"poster": "movie1",
		"aTitle": "Pokemon: The First Movie - Mewtwo Strikes Back",
		"shortTitle": "Mewtwo Strikes Back",
		"aReleaseDate": "November 12, 1999",
		"aDistributor": "Warner Bros.",
		"jTitle": "Mewtwo's Counterattack",
		"jReleaseDate": "July 18, 1998",
		"jDistributor": "Toho",
		"summary": "Ash Ketchum and his friends are tricked into visiting New Island, an island ruled by a mutant Pokémon, Mewtwo. There, they find out about Mewtwo's plans to clone their Pokémon and destroy the world, and a massive battle follows between the clones and the originals—including the 'original' counterpart to Mewtwo: Mew."
	},
	{
		"number": 2,
		"poster": "movie2",
		"aTitle": "Pokemon the Movie 2000: The Power of One",
		"shortTitle": "The Power of One",
		"aReleaseDate": "July 21, 2000",
		"aDistributor": "Warner Bros.",
		"jTitle": "Mirage Pokemon: Lugia's Explosive Birth",
		"jReleaseDate": "July 17, 1999",
		"jDistributor": "Toho",
		"summary": "Ash Ketchum and his friends visit Shamouti Island, the centerpoint of culture in the Orange Islands, just in time for their annual festival in honor of the Chosen One spoken of in legends who would save the world when Lugia's song was not enough to quell the fighting Legendary birds. But when the meddling of a self-named 'Pokémon Collector' causes the legendary birds to begin fighting, will the Chosen One appear in time to help Lugia?"
	},
	{
		"number": 3,
		"poster": "movie3",
		"aTitle": "Pokemon 3: The Movie - Spell of the Unown: Entei",
		"shortTitle": "Spell of the Unown",
		"aReleaseDate": "April 6, 2001",
		"aDistributor": "Warner Bros.",
		"jTitle": "Emperor of the Crystal Tower: Entei",
		"jReleaseDate": "July 8, 2000",
		"jDistributor": "Toho",
		"summary": "When Spencer Hale, a researcher exploring the mystery of the Unown, disappears on an expedition, his daughter Molly is left alone in their mansion in Greenfield. Using tiles of the Unown sent to her by her father, she brings Unown into the Pokémon world, where their power can make real her dreams. When she wishes for her parents to return, however, she wishes her father as an Entei, and then for him to bring her a mother. When Ash's own mother is kidnapped by Entei to serve as Molly's, Ash and his friends must journey into the mansion that has been warped by the Unown's power and Molly's wishes... but can they get to Molly in time to stop the Unown's power from warping the whole Johto region... or even the world?"
	},
	{
		"number": 4,
		"poster": "movie4",
		"aTitle": "Pokemon 4Ever - Celebi: The Voice of the Forest",
		"shortTitle": "The Voice of the Forest",
		"aReleaseDate": "October 11, 2002",
		"aDistributor": "Miramax Films",
		"jTitle": "Celebi: Encounter Beyond Time",
		"jReleaseDate": "July 7, 2001",
		"jDistributor": "Toho",
		"summary": "Forty years in the past, a young Trainer finds a Celebi on the run from a Pokémon poacher. Trying to calm it, the boy is accidentally transported to the present day by Celebi, and thought by all in the past to have vanished. He meets Ash and his friends, but before they can get Celebi to take him back to the past, it is captured by a far more dangerous man, Team Rocket operative Iron-Masked Marauder, whose Dark Balls brainwash Celebi into following his every command."
	},
	{
		"number": 5,
		"poster": "movie5",
		"aTitle": "Pokemon Heroes: Latios & Latias",
		"shortTitle": "Latios & Latias",
		"aReleaseDate": "May 16, 2003",
		"aDistributor": "Miramax Films",
		"jTitle": "Guardian Gods of the City of Water: Latias and Latios",
		"jReleaseDate": "July 13, 2002",
		"jDistributor": "Toho",
		"summary": "In Alto Mare, a legend is told of its guardians, Latios and Latias, who have protected the city for a long time. The Soul Dew, their essence, is kept in Alto Mare to keep the city safe. But when Team Rocket agents Annie and Oakley arrive to attempt to steal the Soul Dew, Ash and his friends must recover it to keep Alto Mare safe at all costs."
	},
	{
		"number": 6,
		"poster": "movie6",
		"aTitle": "Pokemon: Jirachi: Wish Maker",
		"shortTitle": "Jirachi: Wish Maker",
		"aReleaseDate": "June 1, 2004",
		"aDistributor": "Miramax Films",
		"jTitle": "Wishing Star of the Seven Nights: Jirachi",
		"jReleaseDate": "July 19, 2003",
		"jDistributor": "Toho",
		"summary": "A mysterious comet that passes by every millennium awakens Jirachi, a Mythical Pokémon. Using its power, Butler, a magician who was formerly a member of Team Magma, attempts to create a Groudon to further the villainous organization's goals. Can Ash and his friends protect Jirachi during the week that it is awake?"
	},
	{
		"number": 7,
		"poster": "movie7",
		"aTitle": "Pokemon: Destiny Deoxys",
		"shortTitle": "Destiny Deoxys",
		"aReleaseDate": "January 22, 2005",
		"aDistributor": "Miramax Films",
		"jTitle": "Sky-Splitting Visitor: Deoxys",
		"jReleaseDate": "July 17, 2004",
		"jDistributor": "Toho",
		"summary": "When a meteor crashes into Earth, a battle begins between Rayquaza and the Deoxys contained inside. With Rayquaza the victor, researchers pick up a portion of the meteor with the intention of studying it. When the Deoxys has finally recovered four years later, it attacks the city where the researchers call home, just in time for Ash and friends to visit. But why is it attacking? What connection does the meteor have with it?"
	},
	{
		"number": 8,
		"poster": "movie8",
		"aTitle": "Pokemon: Lucario and the Mystery of Mew",
		"shortTitle": "Lucario and the Mystery of Mew",
		"aReleaseDate": "September 19, 2006",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Mew and the Wave Hero: Lucario",
		"jReleaseDate": "July 16, 2005",
		"jDistributor": "Toho",
		"summary": "Ash's Pikachu is taken to the Tree of Beginning by a wild Mew. To get Pikachu back, Ash must now team up with a Lucario from many years past, but with Lucario still bitter about the hero who sealed him away, Ash and friends must discover the hero's true intentions."
	},
	{
		"number": 9,
		"poster": "movie9",
		"aTitle": "Pokemon Ranger and the Temple of the Sea",
		"shortTitle": "Temple of the Sea",
		"aReleaseDate": "March 23, 2007",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Pokemon Ranger and the Prince of the Sea: Manaphy",
		"jReleaseDate": "July 15, 2006",
		"jDistributor": "Toho",
		"summary": "When the Egg of a Mythical Pokémon, Manaphy, with ties to an ancient water-based civilization, falls into the hands of a pirate, a Pokémon Ranger entrusts the Egg to Ash and his friends—specifically May. May must keep the Egg safe until it hatches, and afterward, make sure Manaphy does not fall into the hands of the Phantom, lest Samiya be lost to the seafloor and Manaphy lose its home."
	},
	{
		"number": 10,
		"poster": "movie10",
		"aTitle": "Pokemon: The Rise of Darkrai",
		"shortTitle": "The Rise of Darkrai",
		"aReleaseDate": "February 24, 2008",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Dialga VS Palkia VS Darkrai",
		"jReleaseDate": "July 14, 2007",
		"jDistributor": "Toho",
		"summary": "In Alamos Town, a large shrine to Dialga and Palkia, the Space-Time Towers, sits. But when Dialga and Palkia begin to battle in their dimension, the fight spills over into the Pokémon world, trapping Alamos Town away from the rest of the world. A Darkrai that lives in town tries to help, but is ultimately blamed by the town as the cause of the problem. Can Ash and his friends save Alamos Town before it is destroyed, and prove Darkrai's intentions?"
	},
	{
		"number": 11,
		"poster": "movie11",
		"aTitle": "Pokemon: Giratina and the Sky Warrior",
		"shortTitle": "Giratina and the Sky Warrior",
		"aReleaseDate": "February 13, 2009",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Giratina and the Sky's Bouquet: Shaymin",
		"jReleaseDate": "July 19, 2008",
		"jDistributor": "Toho",
		"summary": "When dark, poisonous clouds begin to appear in the Reverse World, home to Giratina, it takes matters into its own hands and pursues the cause of the clouds: Dialga and Palkia. Finding Dialga, it lures it for revenge, and assumes Shaymin to also be responsible. But this is not the only trouble: a researcher who wishes to make Giratina's power his own is also in pursuit of the Renegade Pokémon. With the balance of the Pokémon world and Reverse World altering due to Dialga and Giratina's own fight, Ash and friends must stop the fighting and get Shaymin to Gracidea to participate in the flower bearing ceremony."
	},
	{
		"number": 12,
		"poster": "movie12",
		"aTitle": "Pokemon: Arceus and the Jewel of Life",
		"shortTitle": "Arceus and the Jewel of Life",
		"aReleaseDate": "November 20, 2009",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Arceus: To a Conquering Spacetime",
		"jReleaseDate": "July 18, 2009",
		"jDistributor": "Toho",
		"summary": "Ash and friends have traveled to Michina Town, an ancient area surrounded by many legends—and unsurprisingly, many legendary Pokémon as well. The fighting between Dialga and Giratina begins again, but Sheena, a young woman who guards Michina Town's shrine, stops it and brings peace between Dialga, Giratina and Palkia. The true reason for the fighting between the three legendary Pokémon is revealed when Arceus emerges, seeking revenge for its betrayal by humanity at the hands of Sheena's ancestor Damos. With even Dialga, Palkia and Giratina unable to stand against the Pokémon said to have created all worlds, Ash, his friends and Sheena must embark on a trip back in time in a desperate bid to undo what went wrong and prevent Arceus's rampage from ever taking place."
	},
	{
		"number": 13,
		"poster": "movie13",
		"aTitle": "Pokemon - Zoroark: Master of Illusions",
		"shortTitle": "Master of Illusions",
		"aReleaseDate": "February 5, 2011",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Ruler of Illusions: Zoroark",
		"jReleaseDate": "July 10, 2010",
		"jDistributor": "Toho",
		"summary": "Ash and friends arrive in Crown City, where the 'Pokémon Baccer World Cup' will be held. However, the city is being destroyed by Raikou, Entei and Suicune, who are all forms of a new and mysterious Pokémon, Zoroark. Zoroark's child, Zorua, asks Ash and his friends for help in saving its mother from the villain who has enslaved it. This draws them into a race against businessman Grings Kodai, who has come to the city in pursuit of Celebi's 'Time Ripple' for his own sinister ends, to save Crown City before Kodai's actions lead to its destruction."
	},
	{
		"number": 14,
		"poster": "movie14a",
		"aTitle": "Pokemon the Movie: White - Victini and Zekrom",
		"shortTitle": "White - Victini and Zekrom",
		"aReleaseDate": "December 3, 2011",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Victini and the Black Hero: Zekrom",
		"jReleaseDate": "July 16, 2011",
		"jDistributor": "Toho",
		"summary": "Ash, Iris, and Cilan arrive in Eindoak Town, a village where the descendants of a race known as the People of the Vale live, to participate in a battle tournament. They meet the Victory Pokémon, Victini, and learn of its deep connection to the history of the People of the Vale and their land. However, when Damon, a man aiming to use the castle known as the Sword of the Vale to restore his people's kingdom to its former glory, captures Victini to move his plan forward, he sets in motion a chain of events that threaten to destroy not only Eindoak Town but the entire world."
	},
	{
		"number": 14.5,
		"poster": "movie14b",
		"aTitle": "Pokemon the Movie: Black - Victini and Reshiram",
		"shortTitle": "Black - Victini and Reshiram",
		"aReleaseDate": "December 10, 2011",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Victini and the White Hero: Reshiram",
		"jReleaseDate": "July 16, 2011",
		"jDistributor": "Toho",
		"summary": "Ash, Iris, and Cilan arrive in Eindoak Town, a village where the descendants of a race known as the People of the Vale live, to participate in a battle tournament. They meet the Victory Pokémon, Victini, and learn of its deep connection to the history of the People of the Vale and their land. However, when Damon, a man aiming to use the castle known as the Sword of the Vale to restore his people's kingdom to its former glory, captures Victini to move his plan forward, he sets in motion a chain of events that threaten to destroy not only Eindoak Town but the entire world."
	},
	{
		"number": 15,
		"poster": "movie15",
		"aTitle": "Pokemon the Movie: Kyurem vs. The Sword of Justice",
		"shortTitle": "Kyurem vs. The Sword of Justice",
		"aReleaseDate": "December 8, 2012",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Kyurem VS the Sacred Swordsman: Keldeo",
		"jReleaseDate": "July 14, 2012",
		"jDistributor": "Toho",
		"summary": "Keldeo is training to become one of the Sacred Swordsmen, like Cobalion, Terrakion, and Virizion. But when it decides to challenge Kyurem to prove its strength, it ends up badly injured. Later encountering Ash and his friends aboard a train to the city of Roushan, Keldeo drags them into its desperate attempt to escape from the enraged Kyurem and its gang of Cryogonal. As Kyurem's relentless pursuit drives the group from the train into the big city and finally deep into the abandoned mine Kyurem calls home, can they help Keldeo find its inner strength and defeat Kyurem to prove itself a true Sacred Swordsman?"
	},
	{
		"number": 16,
		"poster": "movie16",
		"aTitle": "Pokemon the Movie: Genesect and The Legend Awakened",
		"shortTitle": "Genesect and The Legend Awakened",
		"aReleaseDate": "October 19, 2013",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Extreme Speed Genesect: Mewtwo Awakens",
		"jReleaseDate": "July 13, 2013",
		"jDistributor": "Toho",
		"summary": "Distressed due to the loss of their homeland, the Genesect Army attacks New Tork City. Coincidentally, Ash and his friends are visiting the city to see the park called Pokémon Hills. When the Genesect begin rampaging in the city, Ash is protected by the sudden appearance of a familiar Pokémon—Mewtwo. Despite sympathizing with the plight of the Genesect, Mewtwo attempts to convince them to leave New Tork City and go somewhere else where artificial Pokémon can belong, only to get into a conflict with the Red Genesect that leads the team. Can Mewtwo overcome the Genesect to save New Tork City or is the city doomed to be destroyed and changed into the nest of a Pokémon left behind by history?"
	},
	{
		"number": 17,
		"poster": "movie17",
		"aTitle": "Pokemon the Movie: Diancie and the Cocoon of Destruction",
		"shortTitle": "Diancie and the Cocoon of Destruction",
		"aReleaseDate": "November 8, 2014",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "The Cocoon of Destruction and Diancie",
		"jReleaseDate": "July 19, 2014",
		"jDistributor": "Toho",
		"summary": "Diamond Domain is a land deep under the Kalos region where many Carbink live. The land is given life by the Heart Diamond, which can only be created by its princess, Diancie. However, Diancie currently does not have the power to create a new Heart Diamond, and the land is threatened due to the aging of the current one. After meeting Ash and his friends, Diancie sets off on an adventure to find Xerneas, but during their travels, the group comes across the cocoon where Yveltal—said to have destroyed all life in Kalos long ago—sleeps. During a conflict with a gang of jewel thieves targeting Diancie, Yveltal awakens, leading to a crisis that threatens to repeat the disaster of ages past."
	},
	{
		"number": 18,
		"poster": "movie18",
		"aTitle": "Pokemon the Movie: Hoopa and the Clash of Ages",
		"shortTitle": "Hoopa and the Clash of Ages",
		"aReleaseDate": "November 5, 2015",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "The Archdjinni of the Rings: Hoopa",
		"jReleaseDate": "July 18, 2015",
		"jDistributor": "Toho",
		"summary": "One hundred years ago, Dahara City was threatened with destruction when Hoopa brought a number of legendary Pokémon into the area, but was saved when a mysterious man bound its power with the Prison Bottle. In the present, Ash and his friends arrive in Dahara City and meet Meray, who cares for Hoopa in its peaceful Confined form. Meray's brother, Baraz, obtains the Prison Bottle in hopes of restoring Hoopa's true power, but that power has grown angry over the years and seeks revenge. After escaping from the Prison Bottle, the evil Shadow Hoopa goes on a rampage to erase its weaker self, culminating in both Hoopa summoning groups of legendary Pokémon to fight each other. In order to save Dahara City, Meray, Baraz and Ash's friends must recreate the Prison Bottle and stop Shadow Hoopa, but even if they succeed, an even greater threat may still await."
	},
	{
		"number": 19,
		"poster": "movie19",
		"aTitle": "Pokemon the Movie: Volcanion and the Mechanical Marvel",
		"shortTitle": "Volcanion and the Mechanical Marvel",
		"aReleaseDate": "November 4, 2016",
		"aDistributor": "VIZ Media / Warner Bros.",
		"jTitle": "Volcanion and the Mechanical Magearna",
		"jReleaseDate": "July 16, 2016",
		"jDistributor": "Toho",
		"summary": "Ash and his friends encounter Volcanion after a blast of steam from the sky, and Ash becomes bonded to it by an unknown force. Volcanion, who hates humans, is forced to bring Ash along as it heads to the Azoth Kingdom. Volcanion is in pursuit of Magearna, hoping to rescue it from a corrupt minister who has stolen it with the intent of using Magearna's mysterious power to conquer the kingdom of machinery. Ash and Volcanion are forced to work together to rescue Magearna."
	},
	{
		"number": 20,
		"poster": "movie20",
		"aTitle": "Pokemon the Movie: I Choose You!",
		"shortTitle": "I Choose You!",
		"aReleaseDate": "November 5, 2017",
		"aDistributor": "Fathom Events, VIZ Media / Warner Bros.",
		"jTitle": "I Choose You!",
		"jReleaseDate": "July 15, 2017",
		"jDistributor": "Toho",
		"summary": "On his tenth birthday, Ash sets off from Pallet Town to become a Pokémon Trainer alongside a Pikachu that disobeys him. The duo encounter Ho-Oh and, after acquiring a Rainbow Wing, pledge to meet it again one day. With his travel companions Sorrel and Verity, and guided by the mysterious Marshadow, Ash travels to Mount Tensei in search of Ho-Oh. However, they encounter a powerful opponent who stands in their way."
	},
	{
		"number": 21,
		"poster": "movie21",
		"aTitle": "Pokemon the Movie: The Power of Us",
		"shortTitle": "The Power of Us",
		"aReleaseDate": "November 24, 2018",
		"aDistributor": "Fathom Events, VIZ Media / Warner Bros.",
		"jTitle": "Everyone's Story",
		"jReleaseDate": "July 13, 2018",
		"jDistributor": "Toho",
		"summary": "A young athlete whose running days might be behind her, a compulsive liar, a shy researcher, a bitter old woman, and a little girl with a big secret—the only thing they have in common is the annual Wind Festival in Fula City. The festival celebrates the Legendary Pokémon Lugia, who brings the wind that powers this seaside city. When a series of threats endangers not just the festival, but all the people and Pokémon of Fula City, it’ll take more than just Ash and Pikachu to save the day! Can everyone put aside their differences and work together—or will it all end in destruction?"
	},
	{
		"number": 22,
		"poster": "movie22",
		"aTitle": "Pokemon: Mewtwo Strikes Back - Evolution",
		"shortTitle": "Mewtwo Strikes Back - Evolution",
		"aReleaseDate": "February 27, 2020",
		"aDistributor": "Netflix, VIZ Media / Warner",
		"jTitle": "Mewtwo's Counterattack Evolution",
		"jReleaseDate": "July 12, 2019",
		"jDistributor": "Toho",
		"summary": "Ash Ketchum and his friends are tricked into visiting New Island, an island ruled by a mutant Pokémon, Mewtwo. There, they find out about Mewtwo's plans to clone their Pokémon and destroy the world, and a massive battle follows between the clones and the originals—including the 'original' counterpart to Mewtwo: Mew."
	},
	{
		"number": 23,
		"poster": "movie23",
		"aTitle": "Pokemon the Movie: Secrets of the Jungle",
		"shortTitle": "Secrets of the Jungle",
		"aReleaseDate": "2021",
		"aDistributor": "TBA",
		"jTitle": "Koko",
		"jReleaseDate": "December 25, 2020",
		"jDistributor": "Toho",
		"summary": "Ash and Pikachu encounter Koko, a young man who was raised as a Pokémon by Zarude and thus believes himself to be one. They help him begin to uncover his true identity and past, which leads to the revelation of a plot at the Biotope Company that threatens to destroy Zarude's home in the Forest of Okoya."
	},
]
